УТ_для_edt.РасширениеСмарт/src/DataProcessors/ПодборТоваровВДокументПродажи/ПодборТоваровВДокументПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПодборТоваровВДокументПродажи</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections>
    <name>Корзина</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ_для_edt.РасширениеСмарт/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварыКОтгрузке</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources>
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>ВРезерве</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>КОформлению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>КСборке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Собирается</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Собрано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/РеестрДокументов/РеестрДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РеестрДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДополнительнаяЗапись</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Дополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Проведен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаОтраженияВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>НомерПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>НомерДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860178-ace4-11e7-7088-f45c898df8f7">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863b70-ace4-11e7-7088-f45c898df8f7">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ТипСсылки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ДатаДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СостоянияЗаказовКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>СуммаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроцентОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПроцентДолга</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕстьРасхожденияОрдерНакладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/DataProcessors/ПодборТоваровВДокументПродажи/Forms/смарт_ФормаОплаченныеЗаказы/Module.bsl
//++ смарт:Подкин #1099 17.07.2022 19:21:05
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Склад=Неопределено;
    Номенклатура=Неопределено; 
    Сейчас=Неопределено;      
    
    Если Параметры.Свойство("Фон") Тогда
        Элементы.ТЗЗаказы.ЦветФона = Новый Цвет(248, 255, 255);	
    КонецЕсли;
    
    Если Параметры.Свойство("Склад",Склад) И Параметры.Свойство("Номенклатура",Номенклатура) Тогда  
        
        Если Параметры.Оплаченные=Неопределено Тогда 
            ЭтаФорма.Заголовок = "Расшифровка по складу- "+Склад;  
        ИначеЕсли Параметры.Оплаченные Тогда
            ЭтаФорма.Заголовок = "Расшифровка оплаты по складу- "+Склад;   
        Иначе 
            ЭтаФорма.Заголовок = "Расшифровка не оплаченных по складу- "+Склад; 
        КонецЕсли;    
        
        Запрос = Новый Запрос; 
        Если Параметры.Свойство("Сейчас",Сейчас) И Сейчас="Сейчас" Тогда
            Запрос.Текст = 
            "ВЫБРАТЬ
            |   2 КАК Действие,
            |   Таблица.Номенклатура КАК Номенклатура,
            |   Таблица.Склад КАК Склад,
            |   ВЫБОР
            |       КОГДА Таблица.Назначение.Заказ = НЕОПРЕДЕЛЕНО
            |           ТОГДА Таблица.Назначение
            |       ИНАЧЕ Таблица.Назначение.Заказ
            |   КОНЕЦ КАК ДокументОснование,
            |   ВЫБОР
            |       КОГДА Таблица.Назначение.Заказ = НЕОПРЕДЕЛЕНО
            |           ТОГДА ДАТАВРЕМЯ(1, 1, 1)
            |       ИНАЧЕ Таблица.Назначение.Заказ.Дата
            |   КОНЕЦ КАК ДатаДокумента,
            |   0 КАК НачальныйОстаток,
            |   0 КАК Приход,
            |   Таблица.НаличиеПодЗаказОстаток КАК Расход
            |ПОМЕСТИТЬ ВременнаяТаблица
            |ИЗ
            |   РегистрНакопления.ОбеспечениеЗаказов.Остатки(
            |           ,
            |           Номенклатура = &Номенклатура
            |               И Склад = &Склад) КАК Таблица
            |
            |ОБЪЕДИНИТЬ ВСЕ
            |
            |ВЫБРАТЬ 
            |   3 КАК Действие,
            |   Таблица.Номенклатура,
            |   Таблица.Склад,
            |   Таблица.ДокументОтгрузки,
            |   ЕСТЬNULL(РеквизитыРаспоряжения.ДатаДокументаИБ, ДАТАВРЕМЯ(1, 1, 1)),
            |   0,
            |   0,
            |   Таблица.ВРезервеОстаток
            |ИЗ
            |   РегистрНакопления.ТоварыКОтгрузке.Остатки(
            |           ,
            |           Номенклатура = &Номенклатура
            |               И Склад = &Склад) КАК Таблица
            |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеквизитыРаспоряжения
            |       ПО Таблица.ДокументОтгрузки = РеквизитыРаспоряжения.Ссылка
            |           И (НЕ РеквизитыРаспоряжения.ДополнительнаяЗапись)
            |;
            |
            |////////////////////////////////////////////////////////////////////////////////
            |ВЫБРАТЬ
            | ВЫБОР КОГДА  Действие = 2 ТОГДА ""Резерв (обособленный)"" КОГДА Действие = 3 ТОГДА ""Резерв"" КОГДА Действие = 5 ТОГДА ""Резерв к дате отгрузки"" ИНАЧЕ """" КОНЕЦ КАК Действие,
            |   ВременнаяТаблица.ДокументОснование КАК ОбъектРасчетов,
            |   Выразить(ВременнаяТаблица.ДокументОснование КАК Документ.ЗаказКлиента).Контрагент КАК Контрагент,
            |   Выразить(ВременнаяТаблица.ДокументОснование КАК Документ.ЗаказКлиента).Менеджер КАК Менеджер,
            |   СостоянияЗаказовКлиентов.СуммаОплаты КАК СуммаОплаты,
            |   СостоянияЗаказовКлиентов.ПроцентОплаты КАК ПроцентОплаты,
            |   ВременнаяТаблица.Расход КАК КолРезерв
            |ИЗ
            |   ВременнаяТаблица КАК ВременнаяТаблица
            |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
            |       ПО ВременнаяТаблица.ДокументОснование = СостоянияЗаказовКлиентов.Заказ
            |    ГДЕ
            |    Выбор когда &Оплаченные=НЕОПРЕДЕЛЕНО тогда
            |                Истина
            |          Когда &Оплаченные тогда
            |               СостоянияЗаказовКлиентов.СуммаОплаты > 0
            |    Иначе  СостоянияЗаказовКлиентов.СуммаОплаты <= 0 Конец 
            | 
            |    УПОРЯДОЧИТЬ ПО
            |	  ОбъектРасчетов
            |    АВТОУПОРЯДОЧИВАНИЕ"; 
            
            Если Не ЗначениеЗаполнено(Склад) Тогда
                Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Склад = &Склад","");
            ИначеЕсли Склад.ЭтоГруппа Тогда
                Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Склад = &Склад"," И Склад в иерархии (&Склад) ");
            КонецЕсли;
        Иначе          
            
            Запрос.Текст = 
            "ВЫБРАТЬ
            |   5 КАК Действие,
            |   Таблица.Номенклатура КАК Номенклатура,
            |   Таблица.Склад КАК Склад,
            |   Таблица.Регистратор КАК ДокументОснование,
            |   МАКСИМУМ(Таблица.Регистратор.Дата) КАК ДатаДокумента,
            |   СУММА(Таблица.КоличествоИзЗаказов) КАК Расход,
	        |     Таблица.ДатаОтгрузки КАК ДатаОтгрузки
 
            |ПОМЕСТИТЬ ВременнаяТаблица
            |ИЗ
            |   РегистрНакопления.ГрафикОтгрузкиТоваров КАК Таблица
            |ГДЕ
            |   Таблица.КоличествоИзЗаказов <> 0
            |   И Таблица.Номенклатура = &Номенклатура
            |   И Таблица.Склад = &Склад
            |
            |СГРУППИРОВАТЬ ПО
            |   Таблица.Номенклатура,
            |   Таблица.Характеристика,
            |   Таблица.Склад,
            |   ВЫБОР
            |       КОГДА Таблица.ДатаОтгрузки < &НачалоТекущегоДня
            |           ТОГДА &НачалоТекущегоДня
            |       ИНАЧЕ Таблица.ДатаОтгрузки
            |   КОНЕЦ,
            |   Таблица.Регистратор,
            |   Таблица.ДатаОтгрузки
            |;
            |
            |////////////////////////////////////////////////////////////////////////////////
            |ВЫБРАТЬ
            | ВЫБОР КОГДА  Действие = 2 ТОГДА ""Резерв (обособленный)"" КОГДА Действие = 3 ТОГДА ""Резерв"" КОГДА Действие = 5 ТОГДА ""Резерв к дате отгрузки"" ИНАЧЕ """" КОНЕЦ КАК Действие,
            |   ВременнаяТаблица.ДокументОснование КАК ОбъектРасчетов,
            |   Выразить(ВременнаяТаблица.ДокументОснование КАК Документ.ЗаказКлиента).Контрагент КАК Контрагент,
            |   Выразить(ВременнаяТаблица.ДокументОснование КАК Документ.ЗаказКлиента).Менеджер КАК Менеджер,
            |   СостоянияЗаказовКлиентов.СуммаОплаты КАК СуммаОплаты,
            |   СостоянияЗаказовКлиентов.ПроцентОплаты КАК ПроцентОплаты,
            |   ВременнаяТаблица.Расход КАК КолРезерв,
	        |   ВременнаяТаблица.ДатаОтгрузки КАК ДатаОтгрузки
            |ИЗ
            |   ВременнаяТаблица КАК ВременнаяТаблица
            |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
            |       ПО ВременнаяТаблица.ДокументОснование = СостоянияЗаказовКлиентов.Заказ
            |    ГДЕ
            |    Выбор когда &Оплаченные=НЕОПРЕДЕЛЕНО тогда
            |                Истина
            |          Когда &Оплаченные тогда
            |               СостоянияЗаказовКлиентов.СуммаОплаты > 0
            |    Иначе  СостоянияЗаказовКлиентов.СуммаОплаты <= 0 Конец             
            | 
            |    УПОРЯДОЧИТЬ ПО
            |	  ОбъектРасчетов
            |    АВТОУПОРЯДОЧИВАНИЕ";

            
            Элементы.ТЗЗаказыДатаОтгрузки.Видимость=Истина;

        КонецЕсли;
        
        Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
        Запрос.УстановитьПараметр("Склад", Склад);              
        Запрос.УстановитьПараметр("НачалоТекущегоДня", ТекущаяДатаСеанса()); 
        Запрос.УстановитьПараметр("Оплаченные", Параметры.Оплаченные);
        
        ТЗ=Запрос.Выполнить().Выгрузить();
        ТЗ.Колонки.Добавить("ДатыОплаты",ОбщегоНазначения.ОписаниеТипаСтрока(100));
        Для каждого Стр_Оплаты Из ТЗ Цикл
            Попытка
                МассивСсылок = КритерииОтбора.СвязанныеДокументы.Найти(Стр_Оплаты.ОбъектРасчетов); 
            Исключение 
                МассивСсылок = Новый Массив;
            КонецПопытки;
            ДатаПоступления = "";
            Для каждого Стр Из МассивСсылок Цикл
                Если (ТипЗНЧ(Стр.Ссылка) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") ИЛИ ТипЗНЧ(Стр.Ссылка) = Тип("ДокументСсылка.ВзаимозачетЗадолженности")
                    ИЛИ ТипЗНЧ(Стр.Ссылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер")) И НЕ Стр.Ссылка.ПометкаУдаления Тогда
                    ДатаПоступления = ?(ЗначениеЗаполнено(ДатаПоступления), ДатаПоступления+", "+Строка(Формат(Стр.Ссылка.Дата,"ДФ=dd.MM.yyyy")),Строка(Формат(Стр.Ссылка.Дата,"ДФ=dd.MM.yyyy")));	
                КонецЕсли;  
            КонецЦикла; 
            Стр_Оплаты.ДатыОплаты = ДатаПоступления;
        КонецЦикла;
        ТЗЗаказы.Загрузить(ТЗ);
    КонецЕсли; 
    
КонецПроцедуры //-- смарт:Подкин #1099 17.07.2022 19:21:05

&НаКлиенте
Процедура ТЗЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)   
    
    СтандартнаяОбработка=Ложь;            
    ТекСтрока=Элементы.ТЗЗаказы.ТекущиеДанные;
    ПараметрыФормы = Новый Структура("Ключ",ТекСтрока.ОбъектРасчетов); 
    Если ТипЗнч(ТекСтрока.ОбъектРасчетов)=Тип("ДокументСсылка.ЗаказКлиента") Тогда
        ОткрытьФорму("Документ.ЗаказКлиента.Форма.ФормаДокумента",ПараметрыФормы);
    ИначеЕсли ТипЗнч(ТекСтрока.ОбъектРасчетов)=Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
        ОткрытьФорму("Документ.ЗаказНаПеремещение.Форма.ФормаДокумента",ПараметрыФормы); 
    ИначеЕсли ТипЗнч(ТекСтрока.ОбъектРасчетов)=Тип("ДокументСсылка.ЗаказНаСборку") Тогда
        ОткрытьФорму("Документ.ЗаказНаСборку.Форма.ФормаДокумента",ПараметрыФормы);
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
   Элементы.ТЗЗаказыКолРезерв.ТекстПодвала=Формат(ТЗЗаказы.Итог("КолРезерв"),"ЧДЦ=3");
КонецПроцедуры
